# Color mixer
a, b = input(), input()
if (a == 'красный' and b == 'синий') or (a == 'синий' and b == 'красный'):
    print('фиолетовый')
elif (a == 'красный' and b == 'желтый') or (a == 'желтый' and b == 'красный'):
    print('оранжевый')
elif (a == 'синий' and b == 'желтый') or (a == 'желтый' and b == 'синий'):
    print('зеленый')
elif (a == 'красный' and b == 'красный') or (b == 'красный' and a == 'красный'):
    print('красный')
elif (a == 'синий' and b == 'синий') or (b == 'синий' and a == 'синий'):
    print('синий')
elif (a == 'желтый' and b == 'желтый') or (b == 'желтый' and a == 'желтый'):
    print('желтый')
else:
    print('ошибка цвета')